IdeaRS.Connections
PlacementDefinitionType Enumeration
Compatible with IDEA StatiCa 0.0
 Represents types of the definition of placement of beam segments
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum PlacementDefinitionType
Members
Member name | Value | Description
None | 0 |  Direction vector and rotation
DirectionVector | 1 |  Direction vector and rotation
RotationsOfX | 2 |  Angle between segment and plane XY + rotation around axis Z
Lcs | 3 |  Local coordinate vector (direction x, y, z).
See Also
Reference
IdeaRS.Connections.Data Namespace